# Задача 1. Проверьте, существует ли связь между данными, приведёнными в таблице. Выполните задание с помощью библиотеки numpy.

# [56, 37, 48, 45, 46, 43, 41, 45, 47, 48, 57, 63]
# [66, 46, 46, 54, 57, 51, 52, 54, 57, 54, 68, 72]
# [89, 67, 65, 77, 79, 68, 74, 75, 77, 77, 91, 96]

import numpy as np

nums_1 = [56, 37, 48, 45, 46, 43, 41, 45, 47, 48, 57, 63]
nums_2 = [66, 46, 46, 54, 57, 51, 52, 54, 57, 54, 68, 72]
nums_3 = [89, 67, 65, 77, 79, 68, 74, 75, 77, 77, 91, 96]

matrix = [nums_1, nums_2, nums_3]
result = np.corrcoef(matrix)
print(result)

# [[1.         0.90175619 0.87896031] 
#  [0.90175619 1.         0.98700897] 
#  [0.87896031 0.98700897 1.        ]]